app/views/songs/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :Editor %>
    <%= form.select :user_id , User.all.map{ |c| [c.email,c.id]} , class: "form-control"%>

SELECT "playlists".* FROM "playlists"
---
    <%= form.label :Playlist %>
    <%= form.select :playlist_id, Playlist.all.map{ |c| [c.name,c.id]} , class: "form-control"%>