app/views/songs/index.html.erb

           <br>
           <td>Ultima modifica da : <%= User.find(song.user_id).email %></td><br>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]