app/controllers/playlists_controller.rb

  def index
    play =params[:play]
    if !play.nil?
      @songs = Song.where(:playlist_id => play)
      @playlists = Playlist.where(:id => play)
    else
      @songs = Song.all
      @playlists = Playlist.all
---
SELECT "songs".* FROM "songs" WHERE "songs"."playlist_id" = ?  [["playlist_id", 1]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ?  [["id", 1]]
SELECT "songs".* FROM "songs"
SELECT "playlists".* FROM "playlists"

  def create
    @playlist = Playlist.new(playlist_params)

    respond_to do |format|
      if @playlist.save
---
INSERT INTO "playlists" ("name", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "Oriolo"], ["content", "questo ragazzo è molto bravo ed interessante"], ["created_at", "2021-07-09 14:29:24.630909"], ["updated_at", "2021-07-09 14:29:24.630909"], ["user_id", 2]]

  def update
    respond_to do |format|
      if @playlist.update(playlist_params)
---
UPDATE "playlists" SET "content" = ?, "updated_at" = ? WHERE "playlists"."id" = ?  [["content", "Questa playlist raffigura l'eterna giovinezza della notte che cade all'alba e nasce al tramonto"], ["updated_at", "2021-07-09 11:48:12.130600"], ["id", 2]]

  def destroy
    @playlist.destroy
---
DELETE FROM "playlists" WHERE "playlists"."id" = ?  [["id", 3]]