app/controllers/songs_controller.rb

SELECT "playlists".* FROM "playlists"
SELECT "songs".* FROM "songs" WHERE "songs"."playlist_id" = ?  [["playlist_id", 2]]
SELECT "songs".* FROM "songs"
---
  def index
    @playlists = Playlist.all

    play =params[:play]
    if !play.nil?
      @songs = Song.where(:playlist_id => play)
    else
      @songs = Song.all

INSERT INTO "songs" ("title", "artist", "year", "genre", "lyric", "created_at", "updated_at", "playlist_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @song = Song.new(song_params)

    respond_to do |format|
      if @song.save

UPDATE "songs" SET "lyric" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["lyric", "fanculo sta materiaa aooo\r\nmamma +mia mo lo ammazzo \r\nmi faccio saltà in aria soìtto casa sua"], ["updated_at", "2021-07-09 14:59:32.667856"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @song.update(song_params)