app/models/user.rb

	 def set_admin
		self.roles_mask = (self.roles_mask | 3)
		self.save
---
UPDATE "users" SET "updated_at" = ?, "roles_mask" = ? WHERE "users"."id" = ?  [["updated_at", "2021-07-09 15:22:53.525073"], ["roles_mask", 3], ["id", 3]]

	def unset_admin
		self.roles_mask = (self.roles_mask & 2)
		self.save
---
UPDATE "users" SET "updated_at" = ?, "roles_mask" = ? WHERE "users"."id" = ?  [["updated_at", "2021-07-09 14:28:01.481296"], ["roles_mask", 1], ["id", 2]]

	 def set_editor
		  self.roles_mask = 2
		  self.save
---
UPDATE "users" SET "updated_at" = ?, "roles_mask" = ? WHERE "users"."id" = ?  [["updated_at", "2021-07-08 15:18:11.256960"], ["roles_mask", 1], ["id", 1]]

	def unset_editor
		  self.roles_mask = 1
		  self.save
---
UPDATE "users" SET "updated_at" = ?, "roles_mask" = ? WHERE "users"."id" = ?  [["updated_at", "2021-07-09 13:17:18.992782"], ["roles_mask", 0], ["id", 1]]

	def set_iscritto
		self.roles_mask = (self.roles_mask | 1)
		self.save
---
UPDATE "users" SET "updated_at" = ?, "roles_mask" = ? WHERE "users"."id" = ?  [["updated_at", "2021-07-09 14:54:56.651043"], ["roles_mask", 1], ["id", 3]]