app/views/playlists/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :Editor %>
    <%= form.select :user_id , User.all.map{ |c| [c.email,c.id]}, class: "form-control"%>