app/views/playlists/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
             <br>
             <td>Ultima modifica da : <%= User.find(playlist.user_id).email %></td><br>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---

      <br>Ultima modifica da: <%= User.find(playlist.user_id).email %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
             <br>
             <td>Ultima modifica da : <%= User.find(song.user_id).email %></td><br>